Revit 2027 API
ParameterTypeId.CarbonMaterialParamProviderName Property
 "Carbon Provider Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CarbonMaterialParamProviderName { get; }
Public Shared ReadOnly Property CarbonMaterialParamProviderName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CarbonMaterialParamProviderName {
	ForgeTypeId^ get ();
}
static member CarbonMaterialParamProviderName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace